stm32-rs/stm32-rs/svd/vendor_gd32/GD32F1x0.svd
        <register>
          <name>FMCFG</name>
          <displayName>FMCFG</displayName>
          <description>Filter mode configuration register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMOD27</name>
              <description>Filter mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD26</name>
              <description>Filter mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD25</name>
              <description>Filter mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD24</name>
              <description>Filter mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD23</name>
              <description>Filter mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD22</name>
              <description>Filter mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD21</name>
              <description>Filter mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD20</name>
              <description>Filter mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD19</name>
              <description>Filter mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD18</name>
              <description>Filter mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD17</name>
              <description>Filter mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD16</name>
              <description>Filter mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD15</name>
              <description>Filter mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD14</name>
              <description>Filter mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD13</name>
              <description>Filter mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD12</name>
              <description>Filter mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD11</name>
              <description>Filter mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD10</name>
              <description>Filter mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD9</name>
              <description>Filter mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD8</name>
              <description>Filter mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD7</name>
              <description>Filter mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD6</name>
              <description>Filter mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD5</name>
              <description>Filter mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD4</name>
              <description>Filter mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD3</name>
              <description>Filter mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD2</name>
              <description>Filter mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD1</name>
              <description>Filter mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMOD0</name>
              <description>Filter mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FSCFG</name>
          <displayName>FSCFG</displayName>
          <description>Filter scale configuration register</description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FS0</name>
              <description>Filter scale </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS1</name>
              <description>Filter scale </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS2</name>
              <description>Filter scale </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS3</name>
              <description>Filter scale </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS4</name>
              <description>Filter scale </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS5</name>
              <description>Filter scale </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS6</name>
              <description>Filter scale </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS7</name>
              <description>Filter scale </description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS8</name>
              <description>Filter scale </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS9</name>
              <description>Filter scale </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS10</name>
              <description>Filter scale </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS11</name>
              <description>Filter scale </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS12</name>
              <description>Filter scale </description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS13</name>
              <description>Filter scale </description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS14</name>
              <description>Filter scale </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS15</name>
              <description>Filter scale </description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS16</name>
              <description>Filter scale </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS17</name>
              <description>Filter scale </description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS18</name>
              <description>Filter scale </description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS19</name>
              <description>Filter scale </description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS20</name>
              <description>Filter scale </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FS21</name>
              <description>Filter scale </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          <field>
              <name>FS22</name>
              <description>Filter scale </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          <field>
              <name>FS23</name>
              <description>Filter scale </description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          <field>
              <name>FS24</name>
              <description>Filter scale </description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          <field>
              <name>FS25</name>
              <description>Filter scale </description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          <field>
              <name>FS26</name>
              <description>Filter scale </description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          <field>
              <name>FS27</name>
              <description>Filter scale </description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FAFIFO</name>
          <displayName>FAFIFO</displayName>
          <description>Filter associated FIFO register</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FAF0</name>
              <description>Filter 0 associated FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAF1</name>
              <description>Filter 1 associated FIFO</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAF2</name>
              <description>Filter 2 associated FIFO</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAF3</name>
              <description>Filter 3 associated FIFO</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAF4</name>
              <description>Filter 4 associated FIFO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAF5</name>
              <description>Filter 5 associated FIFO</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAF6</name>
              <description>Filter 6 associated FIFO</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAF7</name>
              <description>Filter 7 associated FIFO</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAF8</name>
              <description>Filter 8 associated FIFO</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAF9</name>
              <description>Filter 9 associated FIFO</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAF10</name>
              <description>Filter 10 associated FIFO</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAF11</name>
              <description>Filter 11 associated FIFO</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAF12</name>
              <description>Filter 12 associated FIFO</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAF13</name>
              <description>Filter 13 associated FIFO</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>FAF14</name>
              <description>Filter 14 associated FIFO</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>FAF15</name>
              <description>Filter 15 associated FIFO</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>FAF16</name>
              <description>Filter 16 associated FIFO</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>FAF17</name>
              <description>Filter 17 associated FIFO</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>FAF18</name>
              <description>Filter 18 associated FIFO</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>FAF19</name>
              <description>Filter 19 associated FIFO</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>FAF20</name>
              <description>Filter 20 associated FIFO</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>FAF21</name>
              <description>Filter 21 associated FIFO</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
           <field>
              <name>FAF22</name>
              <description>Filter 22 associated FIFO</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
       <field>
              <name>FAF23</name>
              <description>Filter 23 associated FIFO</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
       <field>
              <name>FAF24</name>
              <description>Filter 24 associated FIFO</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
       <field>
              <name>FAF25</name>
              <description>Filter 25 associated FIFO</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
       <field>
              <name>FAF26</name>
              <description>Filter 26 associated FIFO</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
       <field>
              <name>FAF27</name>
              <description>Filter 27 associated FIFO</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
