stm32-rs/stm32-rs/svd/vendor_gd32/GD32F1x0.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OPA_IVREF</name>
      <description>OPA_IVREF</description>
      <groupName>OPA_IVREF</groupName>
      <baseAddress>0x40007C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OPA_CTL</name>
          <displayName>OPA_CTL</displayName>
          <description>OPA control register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00010101</resetValue>
          <fields>
            <field>
              <name>OPA0PD</name>
              <description>OPA0 power down</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T3OPA0</name>
              <description>T3 switch enable for OPA0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S1OPA0</name>
              <description>S1 switch enable for OPA0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S2OPA0</name>
              <description>S2 switch enable for OPA0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S3OPA0</name>
              <description>S3 switch enable for OPA0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA0CAL_L</name>
              <description>OPA0 offset calibration for P diff</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA0CAL_H</name>
              <description>OPA0 offset calibration for N diff</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA0LPM</name>
              <description>OPA0 low power mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
           <field>
              <name>OPA1PD</name>
              <description>OPA1 power down</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T3OPA1</name>
              <description>T3 switch enable for OPA1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S1OPA1</name>
              <description>S1 switch enable for OPA1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S2OPA1</name>
              <description>S2 switch enable for OPA1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S3OPA1</name>
              <description>S3 switch enable for OPA1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA1CAL_L</name>
              <description>OPA1 offset calibration for P diff</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA1CAL_H</name>
              <description>OPA1 offset calibration for N diff</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA1LPM</name>
              <description>OPA1 low power mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA2PD</name>
              <description>OPA2 power down</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T3OPA2</name>
              <description>T3 switch enable for OPA2</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S1OPA2</name>
              <description>S1 switch enable for OPA2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S2OPA2</name>
              <description>S2 switch enable for OPA2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S3OPA2</name>
              <description>S3 switch enable for OPA2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA2CAL_L</name>
              <description>OPA2 offset calibration for P diff</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA2CAL_H</name>
              <description>OPA2 offset calibration for N diff</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA2LPM</name>
              <description>OPA2 low power mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S4OPA1</name>
              <description>S4 switch enable for OPA1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA_RANGE</name>
              <description>Power supply range</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA0CALOUT</name>
              <description>OPA0 calibration output</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPA1CALOUT</name>
              <description>OPA1 calibration output</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
           <field>
              <name>OPA2CALOUT</name>
              <description>OPA2 calibration output</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPA_BT</name>
          <displayName>OPA_BT</displayName>
          <description>OPA offset trimming for normal mode register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OA0_TRIM_LOW</name>
              <description>OPA0, normal mode 5-bit offset trim value
                 for PMOS pairs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OA0_TRIM_HIGH</name>
              <description>OPA0, normal mode 5-bit offset trim value
                 for NMOS pairs</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OA1_TRIM_LOW</name>
              <description>OPA1, normal mode 5-bit offset trim value 
                for PMOS pairs</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OA1_TRIM_HIGH</name>
              <description>OPA1, normal mode 5-bit offset trim value
                 for NMOS pairs</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OA2_TRIM_LOW</name>
              <description>OPA2, normal mode 5-bit offset trim value
                 for PMOS pairs</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OA2_TRIM_HIGH</name>
              <description>OPA2, normal mode 5-bit offset trim value 
                for NMOS pairs</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT_USER</name>
              <description>user programmed trimming value</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPA_LPBT</name>
          <displayName>OPA_LPBT</displayName>
          <description>OPA offset trimming for low power mode register</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OA0_TRIM_LP_LOW</name>
              <description>OPA0, low power mode 5-bit offset trim value
                 for PMOS pairs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OA0_TRIM_LP_HIGH</name>
              <description>OPA0, low power mode 5-bit offset trim value
                 for NMOS pairs</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OA1_TRIM_LP_LOW</name>
              <description>OPA1, low power mode 5-bit offset trim value 
                for PMOS pairs</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OA1_TRIM_LP_HIGH</name>
              <description>OPA1, low power mode 5-bit offset trim value
                 for NMOS pairs</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OA2_TRIM_LP_LOW</name>
              <description>OPA2, low power mode 5-bit offset trim value
                 for PMOS pairs</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OA2_TRIM_LP_HIGH</name>
              <description>OPA2, low power mode 5-bit offset trim value 
                for NMOS pairs</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IVREF_CTL</name>
          <displayName>IVREF_CTL</displayName>
          <description>IVREF control register</description>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <resetValue>0x10000F00</resetValue>
          <fields>
            <field>
              <name>CSDT</name>
              <description>Current step data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCMOD</name>
              <description>Sink current mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPT</name>
              <description>Current precision trim</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSEL</name>
              <description>Step selection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CREN</name>
              <description>Current reference enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VPT</name>
              <description>Voltage precision tirm</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DECAP</name>
              <description>Disconnect external capacitor</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VREN</name>
              <description>Voltage reference enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
