stm32-rs/stm32-rs/svd/vendor_gd32/GD32F1x0.svd
       <register>
          <name>CFG</name>
          <displayName>CFG</displayName>
          <description>configuration register</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <fields>
            <field>
              <name>OUTSEL</name>
              <description>The output value selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
             <field>
              <name>CCSEL</name>
              <description>Write Capture/Compare register selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIMER15">
      <name>TIMER16</name>
      <baseAddress>0x40014800</baseAddress>
      <interrupt>
        <name>TIMER16</name>
        <value>22</value>
      </interrupt>
    </peripheral>
 <peripheral>
      <name>TSI</name>
      <description>Touch sensing Interface</description>
      <groupName>TSI</groupName>
      <baseAddress>0x40024000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TSI</name>
        <value>8</value>
      </interrupt>
      <registers>
        <register>
          <name>CTL</name>
          <displayName>CTL</displayName>
          <description>control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CDT</name>
              <description>Charge State Duration Time</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CTDT</name>
              <description>Charge Transfer State Duration Time</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ECDT</name>
              <description>Extend Charge State Maximum Duration Time</description>
              <bitOffset>17</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>ECEN</name>
              <description>Extend Charge State Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECDIV</name>
              <description>ECCLK clock division factor</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCDIV</name>
              <description>CTCLK clock division factor</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MCN</name>
              <description>Max cycle number of a sequence</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PINMOD</name>
              <description>Pin mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EGSEL</name>
              <description>Edge selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGMOD</name>
              <description>Trigger mode selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSIS</name>
              <description>TSI start</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSIEN</name>
              <description>TSI enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <displayName>INTEN</displayName>
          <description>interrupt enable register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MNERRIE</name>
              <description> Max Cycle Number Error Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCFIE</name>
              <description>Charge-transfer complete flag Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTC</name>
          <displayName>INTC</displayName>
          <description>interrupt flag clear register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMNERR</name>
              <description>Clear max cycle number error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCTCF</name>
              <description>Clear charge-transfer complete flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTF</name>
          <displayName>INTF</displayName>
          <description>interrupt flag register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MNERR</name>
              <description>Max count error flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCF</name>
              <description>Charge-Transfer complete flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PHM</name>
          <displayName>PHM</displayName>
          <description>Pin hysteresis mode register </description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>G5P3</name>
              <description>G5P3 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5P2</name>
              <description>G5P2 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5P1</name>
              <description>G5P1 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5P0</name>
              <description>G5P0 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4P3</name>
              <description>G4P3 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4P2</name>
              <description>G4P2 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4P1</name>
              <description>G4P1 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4P0</name>
              <description>G4P0 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3P3</name>
              <description>G3P3 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3P2</name>
              <description>G3P2 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3P1</name>
              <description>G3P1 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3P0</name>
              <description>G3P0 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2P3</name>
              <description>G2P3 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2P2</name>
              <description>G2P2 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2P1</name>
              <description>G2P1 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2P0</name>
              <description>G2P0 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1P3</name>
              <description>G1P3 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1P2</name>
              <description>G1P2 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1P1</name>
              <description>G1P1 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1P0</name>
              <description>G1P0 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G0P3</name>
              <description>G0P3 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G0P2</name>
              <description>G0P2 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G0P1</name>
              <description>G0P1 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G0P0</name>
              <description>G0P0 Schmitt trigger hysteresis
              mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ASW</name>
          <displayName>ASW</displayName>
          <description>I/O analog switch register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>G5P3</name>
              <description>G5P3 analog switch
              enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5P2</name>
              <description>G5P2 analog switch
              enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5P1</name>
              <description>G5P1 analog switch
              enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G5P0</name>
              <description>G5P0 analog switch
              enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4P3</name>
              <description>G4P3 analog switch
              enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4P2</name>
              <description>G4P2 analog switch
              enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4P1</name>
              <description>G4P1 analog switch
              enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G4P0</name>
              <description>G4P0 analog switch
              enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3P3</name>
              <description>G3P3 analog switch
              enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3P2</name>
              <description>G3P2 analog switch
              enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3P1</name>
              <description>G3P1 analog switch
              enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G3P0</name>
              <description>G3P0 analog switch
              enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2P3</name>
              <description>G2P3 analog switch
              enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2P2</name>
              <description>G2P2 analog switch
              enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2P1</name>
              <description>G2P1 analog switch
              enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G2P0</name>
              <description>G2P0 analog switch
              enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1P3</name>
              <description>G1P3 analog switch
              enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1P2</name>
              <description>G1P2 analog switch
              enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1P1</name>
              <description>G1P1 analog switch
              enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G1P0</name>
              <description>G1P0 analog switch
              enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G0P3</name>
              <description>G0P3 analog switch
              enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G0P2</name>
              <description>G0P2 analog switch
              enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G0P1</name>
              <description>G0P1 analog switch
              enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>G0P0</name>
              <description>G0P0 analog switch
              enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
